backend/traits/AdminTrait.php

    public static function web_getConfig($name)
    {
        $config = Config::find()->where(['name' => $name])->asArray()->one();
---
SELECT * FROM `dyd_config` WHERE `name`='seo'