backend/controllers/AdminController.php

SELECT * FROM `dyd_admin` WHERE `id`=1
UPDATE `dyd_admin` SET `last_time`='2018-02-11 01:05:45', `login_ip`='2130706433'
UPDATE `dyd_admin` SET `login_num`=`login_num`+1 WHERE `id`=1
---
    public function actionLogin()
    {
        $model = new Admin(['scenario' => 'login']);
        $request = Yii::$app->request;
        if ($request->isPost) {
            if ($model->login($request->post())) {
                $admin=Admin::findOne(['id'=>Yii::$app->admin->id]);
                $admin->updateAll(['last_time' => date('Y-m-d h:i:s', time()),'login_ip' => ip2long(Yii::$app->request->userIP)]);
                $admin->updateAllCounters(['login_num' => 1], ['id'=>Yii::$app->admin->id]);