backend/controllers/ArticleController.php

    public function actionContent(){
        $this->layout = false;
        $content = Article::find()->asArray()->all();
---
SELECT * FROM `dyd_article`

    public function actionArticleContent(){
        $this->layout = false;
        if (Yii::$app->request->get('id')){
            $id = Yii::$app->request->get('id');
            $info = Article::find()->where(['id'=>$id])->asArray()->one();
---
SELECT * FROM `dyd_article` WHERE `id`='48'

    public function actionList()
    {
        $model = Article::find();

        $keyword = trim(\Yii::$app->request->get('keyword'));
        $cate = trim(\Yii::$app->request->get('cate_id'));

        if (!empty($keyword)) {
            $model->andWhere(['like', 'title', $keyword]);
        }

        if (!empty($cate)) {
            $model->andWhere(['cate_id' => $cate]);
        }

//        $model->joinWith('articleCate');

        $count = $model->count();

        $pages = new Pagination(['totalCount' => $count, 'pageSize' => 10]);

        $list = $model
            ->offset($pages->offset)
            ->limit($pages->limit)
            ->orderBy('id DESC')
            ->andWhere(['status'=>1])
            ->asArray()
            ->all();
---
SELECT COUNT(*) FROM `dyd_article`
SELECT * FROM `dyd_article` WHERE `status`=1 ORDER BY `id` DESC LIMIT 10