backend/controllers/IndexController.php

SELECT COUNT(*) FROM `dyd_user` WHERE `create_time` BETWEEN '2018-02-11 00:00:00' AND '2018-02-11 23:59:59'
SELECT COUNT(*) FROM `dyd_user` WHERE `create_time` LIKE '%2018-02%'
SELECT COUNT(*) FROM `dyd_user`
SELECT COUNT(*) FROM `dyd_entrepot` WHERE `is_delete`=1
SELECT COUNT(*) FROM `dyd_entrepot` WHERE (`is_delete`=1) AND (`status`=0)
---
    public function actionHome()
    {
        //新订单通知
        $orderCount  = $this->tip();
        $url = Url::to(['order/index']);
        if(!empty($orderCount)){
            echo "
                <div class=\"wrapper wrapper-content\" id='divids'>
                <div class=\"alert alert-info alert-dismissable\">
                 <button aria-hidden=\"true\" data-dismiss=\"alert\" class=\"close\" type=\"button\">×</button>
                      当前有<b>$orderCount</b>个待发货订单！请尽快发货！
                     <a class=\"alert-link\" href=\"$url\">&nbsp;&nbsp;&nbsp;点击跳转</a>
                </div>
                </div>";
        }


        //客户统计
            //今日新增
            $beginToday= date('Y-m-d H:i:s',mktime(0,0,0,date('m'),date('d'),date('Y')));
            $endToday=date('Y-m-d H:i:s',mktime(0,0,0,date('m'),date('d')+1,date('Y'))-1);
            $dayCount =  User::find()->where(['between', 'create_time', $beginToday, $endToday])->count();

            //当月新增
            $month = date('Y-m',time());
            $monthCount = User::find()->where(['like', 'create_time', $month])->count();


            //客户总数
            $totalCount =  User::find()->count();


            //仓库统计  总数
            $EntrepotCount = Entrepot::find()->where(['is_delete'=>1])->count();
            //冻结
            $freezeCount = Entrepot::find()->where(['is_delete'=>1,'status'=>0])->count();

SELECT SUM(price) FROM `dyd_order` WHERE (`order_status`=1) AND (`user_del`=0)
---
            //实例化
            $order = Order::find();
            //订单金额
            $orderMoney = $order->where(['order_status'=>1,'user_del'=>0])->sum('price');

SELECT `dyd_message`.* FROM `dyd_message` LEFT JOIN `dyd_user` ON `dyd_message`.`user_id` = `dyd_user`.`id` WHERE `dyd_message`.`type`=0 ORDER BY `id` DESC
---
            //实例化
            $message = Message::find();
            $message->joinWith('user');
            $userInfo = $message->where(['dyd_message.type'=>0])->orderBy('id desc')->asArray()->all();

SELECT COUNT(*) FROM `dyd_order` WHERE (`order_status`=0) AND (`user_del`=0)
---
    public function tip(){
        //查询待或订单
        $countOrder = Order::find()->where(['order_status'=>0,'user_del'=>0])->count();