merchant/controllers/MerchantOrderController.php

    public function actionIndex()
    {
        $order = Order::find();

        $order_status =  Yii::$app->request->get('order_status');

        //查询条件
        if(!empty($order_status)){
            if($order_status != '00'){
                $order_status === '01' ? $order_status = 0 : $order_status;

                $order->andWhere(['dyd_order.order_status' =>$order_status]);
            }
        }

        //订单号检索
        $keyword = $this->request->get('keyword');
        if(!empty($keyword)){
            $order->andwhere(['or', ['like', 'order_num', trim($keyword)]]);
        }

        //仓库ID
        $order->andWhere(['dyd_order.user_del' => '0','entrepot_id'=> Yii::$app->admin->getIdentity()['entrepot']]);

        $order->joinWith('entrepot'); //所属仓库
        $order->joinWith('user');

        $page  = new Pagination(['totalCount' => $order->count(), 'pageSize' => 15]);
        $lists = $order->offset($page->offset)
            ->limit($page->limit)
            ->orderBy('id DESC')->all();
---
SELECT COUNT(*) FROM `dyd_order` LEFT JOIN `dyd_entrepot` ON `dyd_order`.`entrepot_id` = `dyd_entrepot`.`id` LEFT JOIN `dyd_user` ON `dyd_order`.`user_id` = `dyd_user`.`id` WHERE (`dyd_order`.`user_del`='0') AND (`entrepot_id`=7)
SELECT * FROM `dyd_entrepot` WHERE `id`=7
SELECT * FROM `dyd_user` WHERE `id`=4
SELECT `dyd_order`.* FROM `dyd_order` LEFT JOIN `dyd_entrepot` ON `dyd_order`.`entrepot_id` = `dyd_entrepot`.`id` LEFT JOIN `dyd_user` ON `dyd_order`.`user_id` = `dyd_user`.`id` WHERE (`dyd_order`.`user_del`='0') AND (`entrepot_id`=7) ORDER BY `id` DESC LIMIT 15

    public function actionShow()
    {
        $id    = $this->request->get('id');
        if(\Yii::$app->request->isGet){

            //实例化
            $order   =  Order::find();

            $orderDetail = OrderDetail::find();

            $order->where(['dyd_order.id'=>$id]); //条件
            $order->joinWith('detail'); //订单详情
            $order->joinWith('user'); //用户
            $order->joinWith('address'); //收货地址
            $order->joinWith('entrepot'); //所属仓库

            $lists = $order->asArray()->one();

            //关联商品表 查询商品详情
            foreach ($lists['detail'] as $key=>$v){
                $lists['detail'][$key]['img'] = Goods::find()->where(['id'=>$v['goods_id']])->asArray()->one();
            }

            //快递公司
            $GodownTypeb = Courier::find()->where(['is_show'=>1])->asArray()->all();
---
SELECT * FROM `dyd_order_detail` WHERE `order_id`='128'
SELECT * FROM `dyd_entrepot` WHERE `id`='7'
SELECT * FROM `dyd_user` WHERE `id`='4'
SELECT `dyd_order`.* FROM `dyd_order` LEFT JOIN `dyd_order_detail` ON `dyd_order`.`id` = `dyd_order_detail`.`order_id` LEFT JOIN `dyd_user` ON `dyd_order`.`user_id` = `dyd_user`.`id` LEFT JOIN `dyd_user_address` ON `dyd_order`.`address_id` = `dyd_user_address`.`id` LEFT JOIN `dyd_entrepot` ON `dyd_order`.`entrepot_id` = `dyd_entrepot`.`id` WHERE `dyd_order`.`id`='128'
SELECT * FROM `dyd_goods` WHERE `id`='40'
SELECT * FROM `dyd_courier` WHERE `is_show`=1