merchant/controllers/MerchantIndexController.php

    public function actionHome()
    {
        //仓库ID
        $entrepotId =  Yii::$app->admin->getIdentity()['entrepot'];

        //新订单通知
        $orderCount  = $this->tip();
        $url = Url::to(['merchant-order/index']);
        if(!empty($orderCount)){
            echo "
                <div class=\"wrapper wrapper-content\" id='divids'>
                <div class=\"alert alert-info alert-dismissable\">
                 <button aria-hidden=\"true\" data-dismiss=\"alert\" class=\"close\" type=\"button\">×</button>
                      当前有<b>$orderCount</b>个待发货订单！请尽快发货！
                     <a class=\"alert-link\" href=\"$url\">&nbsp;&nbsp;&nbsp;点击跳转</a>
                </div>
                </div>";
        }


        //客户统计
        //今日新增
        $beginToday= date('Y-m-d H:i:s',mktime(0,0,0,date('m'),date('d'),date('Y')));
        $endToday=date('Y-m-d H:i:s',mktime(0,0,0,date('m'),date('d')+1,date('Y'))-1);
        $dayCount =  Clientele::find()->where(['between', 'addTime', $beginToday, $endToday])->andWhere(['entrepot_id'=>Yii::$app->admin->getIdentity()['entrepot'],'is_del'=>1])->count();

        //当月新增
        $month = date('Y-m',time());
        $monthCount = Clientele::find()->where(['like', 'addTime', $month])->andWhere(['entrepot_id'=>Yii::$app->admin->getIdentity()['entrepot'],'is_del'=>1])->count();


        //客户总数
        $totalCount =  Clientele::find()->where(['entrepot_id'=>Yii::$app->admin->getIdentity()['entrepot'],'is_del'=>1])->count();
---
SELECT COUNT(*) FROM `dyd_clientele` WHERE (`addTime` BETWEEN '2018-02-10 00:00:00' AND '2018-02-10 23:59:59') AND ((`entrepot_id`=2) AND (`is_del`=1))
SELECT COUNT(*) FROM `dyd_clientele` WHERE (`addTime` LIKE '%2018-02%') AND ((`entrepot_id`=2) AND (`is_del`=1))
SELECT COUNT(*) FROM `dyd_clientele` WHERE (`entrepot_id`=2) AND (`is_del`=1)

        //实例化
        $message = Message::find();
        $message->joinWith('user');
        $userInfo = $message->where(['dyd_message.type'=>0])->asArray()->all();
---
SELECT `dyd_message`.* FROM `dyd_message` LEFT JOIN `dyd_user` ON `dyd_message`.`user_id` = `dyd_user`.`id` WHERE `dyd_message`.`type`=0

    public function tip(){
        //查询待或订单
        $countOrder = Order::find()->where(['order_status'=>0,'user_del'=>0,'entrepot_id'=>Yii::$app->admin->getIdentity()['entrepot']])->count();
---
SELECT COUNT(*) FROM `dyd_order` WHERE (`order_status`=0) AND (`user_del`=0) AND (`entrepot_id`=2)