merchant/controllers/MerchantGoodsController.php

SELECT * FROM `dyd_cate` WHERE `is_show`=1 ORDER BY `sort`
---
//        echo $commandQuery->createCommand()->getRawSql();


        $cate=TreeTrait::generateTree(Cate::find()->where(['is_show'=>1])->asArray()->orderBy('sort ASC')->all());

SELECT `name` FROM `dyd_cate` WHERE `id`='17'
---
    public function actionCreate(){

        $request=Yii::$app->request;

        if ($request->isPost){
            //处理json串
            Yii::$app->response->format=Response::FORMAT_JSON;
            //接受post数据
            $post=$request->post();

            if (!empty($post['paramName'])){
                return $this->actionUpload($post['paramName']);
            }else{

                if(empty($post['cover'])){
                    return ['status'=>2,'info'=>'封面图片不能为空'];die;
                }
                if (empty($post['img'])){
                    return ['status'=>2,'info'=>'商品图片不能为空'];die;
                }

                //添加商品
                $model =new Goods();
                $model->entrepot=Yii::$app->admin->getIdentity()['entrepot'];
                $model->cover=implode(',',array_filter($post['cover']));
                $model->img=implode(',',array_filter($post['img']));
                $model->info=$post['content'];
                $model->cate_id=$post['cate_id'];
                $cate_name = Cate::find()->where(['id' => $post['cate_id']])->select('name')->one();

SELECT * FROM `dyd_cate` WHERE `is_show`=1 ORDER BY `sort`
SELECT `id`, `entrepot_name` FROM `dyd_entrepot` WHERE (`status`=1) AND (`is_delete`=1)
---
            }
        }else{
            $model=new Goods();
            $cate=TreeTrait::generateTree(Cate::find()->where(['is_show'=>1])->asArray()->orderBy('sort ASC')->all());
            $article_cate=TreeTrait::generateTree(ArticleCate::find()->where(['is_show'=>1])->asArray()->orderBy('sort ASC')->all());
            $entrepot = Entrepot::find()->where(['status'=>1,'is_delete'=>1])->asArray()->select('id,entrepot_name')->all();

SELECT * FROM `dyd_cate` WHERE `is_show`=1 ORDER BY `sort`
---


        $cate=TreeTrait::generateTree(Cate::find()->where(['is_show'=>1])->asArray()->orderBy('sort ASC')->all());
        $article_cate=TreeTrait::generateTree(ArticleCate::find()->where(['is_show'=>1])->asArray()->orderBy('sort ASC')->all());

DELETE FROM `dyd_goods` WHERE `id`='42'
DELETE FROM `dyd_godown_detail` WHERE `goods_id`='42'
---
    public function actionDelete(){
        $request=Yii::$app->request;
        if ($request->isPost){
            $id=$request->post('id');

            $id_array=array_filter(explode(',',$id));

            foreach ($id_array as $id){
                //删除商品
                Goods::deleteAll(['id' => $id]);
                //删除一级规格
                Spec::deleteAll(['goods_id' => $id]);
                //删除子规格
                AloneSpec::deleteAll(['goods_id' => $id]);
                //山出入库明细
                GodownDetail::deleteAll(['goods_id' => $id]);

SELECT * FROM `dyd_entrepot_goods` WHERE `goods_id`='42'
---
    public function entrepotDelete($id){
        $res = EntrepotGoods::find()->where(['goods_id'=>$id])->asArray()->all();