merchant/models/Admin.php

    public function validatePass()
    {
        $data = self::find()->where(['username' => $this->username])->asArray()->one();
---
SELECT * FROM `dyd_admin` WHERE `username`='damai'

    public function getAdmin(){
        return self::find()->where(['username'=>$this->username])->one();
---
SELECT * FROM `dyd_admin` WHERE `username`='damai'