merchant/models/Entrepot.php

    public static function return_name($id){
          $result = Entrepot::find()->where(['id'=>$id])->select('entrepot_name')->one();
---
SELECT `entrepot_name` FROM `dyd_entrepot` WHERE `id`=2

    public static function return_time($id){
        $result = Entrepot::find()->where(['id'=>$id])->select('add_time')->one();
---
SELECT `add_time` FROM `dyd_entrepot` WHERE `id`=2

    public static function return_status($id){
        $result = Entrepot::find()->where(['id'=>$id])->select('status')->one();
---
SELECT `status` FROM `dyd_entrepot` WHERE `id`=2