merchant/models/Goods.php

    static public function return_goods()
    {
        $countGoods = Goods::find()->where(['entrepot'=> Yii::$app->admin->getIdentity()['entrepot']])->count();
---
SELECT COUNT(*) FROM `dyd_goods` WHERE `entrepot`=2