merchant/models/Order.php

    static public function return_goods()
    {
        //查询待或订单
        $countOrder = Order::find()->where(['order_status'=>0,'user_del'=>0,'entrepot_id'=> Yii::$app->admin->getIdentity()['entrepot']])->count();
---
SELECT COUNT(*) FROM `dyd_order` WHERE (`order_status`=0) AND (`user_del`=0) AND (`entrepot_id`=2)