backend/models/Admin.php

    public function validatePass()
    {
        $data = self::find()->where(['username' => $this->username])->asArray()->one();
---
SELECT * FROM `dyd_admin` WHERE `username`='admin'

    public function getAdmin(){
        return self::find()->where(['username'=>$this->username])->one();
---
SELECT * FROM `dyd_admin` WHERE `username`='admin'

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `dyd_admin` WHERE `id`=15