backend/models/Goods.php

    static public function return_goods()
    {
        $countGoods = Goods::find()->count();
---
SELECT COUNT(*) FROM `dyd_goods`