backend/components/Log.php

INSERT INTO `dyd_log` (`description`, `route`, `admin_id`, `admin_username`, `created_at`) VALUES ('管理员 [ yihao ] 通过 merchant\\models\\Goods [ {{%goods}} ]  创建 ID为 43 的记录: <br>ID(id) => 43,<br>Entrepot(entrepot) => 7,<br>Cate ID(cate_id) => 17,<br>Cate Name(cate_name) => 手工编织地毯,<br>Brand Id(brand_id) => 19,<br>Brand Name(brand_name) => 海马地毯HAIMA,<br>商品标题(title) => 壹号仓库（库存）,<br>商品单价(list_price) => 1196,<br>Sold(sold) => ,<br>Repertory(repertory) => ,<br>Total(total) => ,<br>商品详情(info) => <p>壹号仓库（库存）</p>,<br>Num(num) => ,<br>Price(price) => ,<br>封面图片(cover) => /uploads/merchant_img/20180208/20180208153844_57279.jpg,<br>轮番图片(img) => /uploads/merchant_img/20180208/20180208153845_14919.jpg,/uploads/merchant_img/20180208/20180208153845_66552.jpg,/uploads/merchant_img/20180208/20180208153845_98585.jpg,<br>是否热卖(is_hot) => ,<br>是否促销(is_sale) => ,<br>促销价格(sale_price) => ,<br>创建时间(create_time) => 2018-02-08 15:38:52,<br>更新时间(update_time) => ,<br>Status(status) => ', 'merchant-goods/create', '15', 'yihao', '2018-02-08 15:38:52')
---
    public static function create($event)
    {
        if ($event->sender->className() !== AdminLogModel::className()) {
            $desc = '<br>';
            if ($event->sender->getAttributes()){
                $attributelabel=$event->sender->getAttributes();
            }else{
               $attributelabel=$event->sender->attributes;
            }

            foreach ($attributelabel as $name => $value) {
                $desc .= $event->sender->getAttributeLabel($name) . '(' . $name . ') => ' . $value . ',<br>';
            }
            $desc = substr($desc, 0, -5);
            $model = new AdminLogModel();
            $class = $event->sender->className();
            $id_des = '';

            if (isset($event->sender->id)) {
                $id_des = 'ID为 ' . $event->sender->id;
            }

            $model->description = '管理员 [ ' . yii::$app->admin->identity->username . ' ] 通过 ' . $class . ' [ ' . $class::tableName() . ' ] ' . " 创建 {$id_des} 的记录: " . $desc;
            $model->route = Yii::$app->controller->id . '/' . Yii::$app->controller->action->id;
            $model->admin_id = yii::$app->admin->id;
            $model->admin_username = yii::$app->admin->identity->username;
            $model->created_at=date('Y-m-d H:i:s',time());
            $model->save(false);